{
  "name": "Apple iPhone 16 Pro Max 256 GB: 5G Mobile phone with Apple Intelligence, Camera Control, A18 Pro Chip and a Huge Leap in Battery Life. Works with AirPods; Desert Titanium",
  "current_price": 1099.0,
  "original_price": 1199.0,
  "discount": 100.0,
  "discount_percentage": 8.3,
  "in_stock": true,
  "product_id": "B0DGHZ1MC2",
  "rating": 4.4,
  "review_count": 341,
  "brand": "Visit the Apple Store",
  "features": [
    "STUNNING TITANIUM DESIGN — iPhone 16 Pro Max has a strong and light titanium design with a larger 6.9-inch Super Retina XDR display. It’s remarkably durable with the latest-generation Ceramic Shield front that’s 2x tougher than any smartphone glass.",
    "BUILT FOR APPLE INTELLIGENCE — Apple Intelligence helps you write, express yourself and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data — not even Apple.",
    "TAKE TOTAL CAMERA CONTROL — Camera Control gives you an easier way to quickly access camera tools, like zoom or depth of field, so you can take the perfect shot in record time.",
    "MAGNIFICENT SHOTS — Take your videos to a whole new level with 4K 120 fps Dolby Vision, enabled by the 48MP Fusion camera. The improved 48MP Ultra Wide camera lets you capture mesmerising detail in macro pics and wide angle photos.",
    "PHOTOGRAPHIC STYLES — The latest-generation Photographic Styles give you greater creative flexibility, so you can make every photo even more you. And thanks to advances in the image pipeline, you can now reverse any style, any time.",
    "THE POWER OF A18 PRO — A18 Pro chip enables Apple Intelligence with a faster Neural Engine, improved CPU and GPU, and a big jump in memory bandwidth. It also drives advanced video and photo features and powers AAA gaming.",
    "A HUGE LEAP IN BATTERY LIFE — iPhone 16 Pro Max delivers an incredibly power-efficient performance with up to 33 hours video playback. Charge via USB-C or snap on a MagSafe charger for faster wireless charging.",
    "CUSTOMISE YOUR IPHONE — With iOS 18, you can tint your Home Screen icons with any colour. Find your favourite shots faster in the redesigned Photos app. And add playful, animated effects to any word, phrase or emoji in iMessage.",
    "VITAL SAFETY FEATURES — With Crash Detection, iPhone can detect a serious car crash and call for help if you can't",
    "LEGAL DISCLAIMERS — This is a summary of the main product features."
  ],
  "retailer": "Amazon",
  "url": "https://www.amazon.co.uk/Apple-iPhone-Pro-Max-256/dp/B0DGHZ1MC2?th=1",
  "timestamp": "2025-05-20T17:43:20.784601"
}